'use client'
import { Button } from '@/components/ui/button';
import InterestPage from '@/components/InterestPage';
import CommunityDisplay from '@/components/CommunityDisplay';
import { useState } from 'react';
import ProductionFacility from '@/components/ProductionFacility';
import RenewableProduction from '@/components/Charts/RenewableProduction';
import RenewableProduction2 from '@/components/Charts/RenewableProduction2';
import ConnectionRequests from '@/components/ConnectionRequests';
import Image from 'next/image';
import topleft from '@/public/images/Ellipse 89.png'
import image1 from '@/public/images/Frame 427319915.png'
import image2 from '@/public/images/Frame 427319913.png'
import image3 from '@/public/images/Frame 427319914 (4).png'


const page = () => {
    const [activeTab, setActiveTab] = useState<'production' | 'municipal' | 'facilities' | 'requests'>('production');

    const handleTab = (tab: 'production' | 'municipal' | 'facilities' | 'requests') => {
        setActiveTab(activeTab === tab ? "production" : tab);
    }

    return (
        <div className="">
            <Image src={topleft} width={600} height={600} className='md:w-[800px] md:h-[500px] w-[300px] h-[200px] absolute md:top-0 left-0 z-10' alt='image' />
            <div className="container mx-auto px-5 md:py-[52px] py-5 md:space-y-[52px] space-y-5 relative w-full overflow-hidden" >
                {/* Main Content */}

                <section className="bg-[#FDFBF6] border border-[#DEDEDE]/70 md:rounded-[40px] rounded-[20px] overflow-hidden min-h-[500px]">
                    <div className="relative z-10 min-h-[500px] flex md:flex-row flex-col-reverse lg:gap-[0px]">
                        <div className="w-full text-right md:p-[60px] p-6 md:pb-[30px]">
                            <h2 className="md:text-3xl text-2xl font-bold text-[#484C56]">אנרגיות מתחדשות</h2>
                            <div className="w-[46px] h-1 bg-[#276E4E] md:my-5 my-3"></div>
                            <div className="flex flex-col gap-2 max-w-[1043px] w-full md:text-xl text-base">
                                <p className="text-[#484C56] max-w-full leading-[140%]">
                                    אפשר להכניס כאן הסבר. לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית הועניב היושבב שערש שמחויט - שלושע ותלברו חשלו שעותלשך וחאית נובש                                 </p>
                            </div>

                            <div className="md:mt-20 mt-10">
                                <h3 className="md:text-2xl text-lg font-bold text-[#276E4E] md:mb-4 mb-2">מה מעניין אותך?</h3>

                                <div className="flex flex-wrap md:gap-3 gap-2 space-x-0 space-y-0">
                                    <Button
                                        variant="outline"
                                        onClick={() => handleTab('production')}
                                        className={`w-max flex items-center gap-2 justify-between md:px-3 px-2 h-10 border rounded-full transition-all ${activeTab === 'production'
                                            ? 'border-[#1E8025] text-[#1E8025] '
                                            : 'border-[#DEDEDE] hover:bg-white/90 text-slate-700 bg-transparent'
                                            }`}
                                    >
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M25.4271 24.6307V24.0089H7.15237L10.0002 10.3791H21.8113L24.8177 24.7582L25.4271 24.6307V24.0089V24.6307L26.0365 24.5033L22.9275 9.62982C22.8684 9.34068 22.6134 9.1355 22.3181 9.1355H9.49657C9.20122 9.1355 8.94938 9.34068 8.8872 9.62982L5.7782 24.5033C5.74089 24.6867 5.78754 24.8764 5.90568 25.0225C6.02382 25.1686 6.20103 25.2525 6.38757 25.2525H25.4271C25.6136 25.2525 25.7908 25.1686 25.909 25.0225C26.0271 24.8764 26.0738 24.6867 26.0365 24.5033L25.4271 24.6307Z" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                            <path d="M13.0874 9.73877L11.8438 24.55L13.0811 24.6526L14.3247 9.84135" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                            <path d="M17.4922 9.84135L18.7358 24.6526L19.9732 24.55L18.7296 9.73877" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                            <path d="M24.4552 19.1934H7.25V20.437H24.4552" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                            <path d="M23.2059 13.6091H8.5625V14.8527H23.2059" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                            <path d="M18.2744 27.3665V26.7447H14.1674V25.2524H17.6526V27.3665H18.2744V26.7447V27.3665H18.8962V24.6306C18.8962 24.4658 18.8309 24.3073 18.7128 24.1922C18.5978 24.0772 18.4361 24.0088 18.2744 24.0088H13.5456C13.3809 24.0088 13.2223 24.0741 13.1073 24.1922C12.9922 24.3073 12.9238 24.4689 12.9238 24.6306V27.3665C12.9238 27.5313 12.9891 27.6899 13.1073 27.8049C13.2223 27.9199 13.384 27.9883 13.5456 27.9883H18.2744C18.4392 27.9883 18.5978 27.923 18.7128 27.8049C18.8278 27.6899 18.8962 27.5282 18.8962 27.3665H18.2744Z" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                            <path d="M20.2858 26.7449H11.5339C11.1919 26.7449 10.9121 27.0247 10.9121 27.3667C10.9121 27.7087 11.1919 27.9885 11.5339 27.9885H20.2858C20.6277 27.9885 20.9076 27.7087 20.9076 27.3667C20.9076 27.0247 20.6277 26.7449 20.2858 26.7449Z" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                            <path d="M27.2936 4.91043H26.9827C26.9827 5.2462 26.8459 5.54778 26.6252 5.77163C26.4044 5.99237 26.1029 6.12917 25.764 6.12917C25.4282 6.12917 25.1267 5.99237 24.9028 5.77163C24.6821 5.55089 24.5453 5.24931 24.5453 4.91043C24.5453 4.57466 24.6821 4.27308 24.9028 4.04923C25.1235 3.82849 25.4251 3.6917 25.764 3.6917C26.0998 3.6917 26.4013 3.82849 26.6252 4.04923C26.8459 4.26997 26.9827 4.57155 26.9827 4.91043H27.2936H27.6045C27.6045 3.89689 26.7807 3.073 25.7671 3.073C24.7505 3.073 23.9297 3.89689 23.9297 4.91043C23.9297 5.92707 24.7536 6.74786 25.7671 6.74786C26.7838 6.74786 27.6045 5.92396 27.6045 4.91043H27.2936Z" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                            <path d="M25.457 1.47789V2.34843C25.457 2.51942 25.5969 2.65933 25.7679 2.65933C25.9389 2.65933 26.0788 2.51942 26.0788 2.34843V1.47789C26.0788 1.3069 25.9389 1.16699 25.7679 1.16699C25.5969 1.16699 25.457 1.3069 25.457 1.47789Z" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                            <path d="M25.457 7.47228V8.34281C25.457 8.51381 25.5969 8.65371 25.7679 8.65371C25.9389 8.65371 26.0788 8.51381 26.0788 8.34281V7.47228C26.0788 7.30128 25.9389 7.16138 25.7679 7.16138C25.5969 7.16138 25.457 7.29817 25.457 7.47228Z" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                            <path d="M27.9721 2.26159L27.3566 2.87717C27.2353 2.99842 27.2353 3.1943 27.3566 3.31555C27.4778 3.4368 27.6737 3.4368 27.7949 3.31555L28.4105 2.69997C28.5318 2.57872 28.5318 2.38284 28.4105 2.26159C28.2924 2.14034 28.0934 2.14034 27.9721 2.26159Z" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                            <path d="M23.7339 6.49914L23.1183 7.11472C22.997 7.23597 22.997 7.43185 23.1183 7.5531C23.2395 7.67435 23.4354 7.67435 23.5566 7.5531L24.1722 6.93752C24.2935 6.81627 24.2935 6.62039 24.1722 6.49914C24.0541 6.37789 23.8551 6.37789 23.7339 6.49914Z" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                            <path d="M29.1951 4.59937H28.3246C28.1536 4.59937 28.0137 4.73927 28.0137 4.91027C28.0137 5.08126 28.1536 5.22117 28.3246 5.22117H29.1951C29.3661 5.22117 29.506 5.08126 29.506 4.91027C29.506 4.73927 29.3692 4.59937 29.1951 4.59937Z" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                            <path d="M23.2049 4.59937H22.3343C22.1633 4.59937 22.0234 4.73927 22.0234 4.91027C22.0234 5.08126 22.1633 5.22117 22.3343 5.22117H23.2049C23.3758 5.22117 23.5158 5.08126 23.5158 4.91027C23.5158 4.73927 23.3758 4.59937 23.2049 4.59937Z" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                            <path d="M28.4144 7.11472L27.7988 6.49914C27.6776 6.37789 27.4817 6.37789 27.3605 6.49914C27.2392 6.62039 27.2392 6.81627 27.3605 6.93752L27.976 7.5531C28.0973 7.67435 28.2932 7.67435 28.4144 7.5531C28.5357 7.43495 28.5357 7.23597 28.4144 7.11472Z" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                            <path d="M24.1761 2.87717L23.5605 2.26159C23.4393 2.14034 23.2434 2.14034 23.1222 2.26159C23.0009 2.38284 23.0009 2.57872 23.1222 2.69997L23.7378 3.31555C23.859 3.4368 24.0549 3.4368 24.1761 3.31555C24.2974 3.1943 24.2974 2.99842 24.1761 2.87717Z" fill={activeTab === 'production' ? "#1E8025" : "#59687D"} />
                                        </svg>
                                        <span className="font-medium">ייצור אנרגיות מתחדשות</span>
                                    </Button>

                                    <Button
                                        variant="outline"
                                        onClick={() => handleTab('municipal')}
                                        className={`w-max flex items-center gap-2 justify-between md:px-3 px-2 h-10 border rounded-full transition-all ${activeTab === 'municipal'
                                            ? 'border-[#1E8025] text-[#1E8025] '
                                            : 'border-[#DEDEDE] hover:bg-white/90 text-slate-700 bg-transparent'
                                            }`}
                                    >
                                        <svg width="33" height="32" viewBox="0 0 33 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M30.9102 16C30.9102 24.8366 23.7467 32 14.9102 32C6.0736 32 1.41016 27.3366 1.41016 18.5C1.41016 9.66344 11.0736 0 19.9102 0C28.7467 0 30.9102 7.16344 30.9102 16Z" fill={activeTab === 'municipal' ? "#1E8025" : "#59687D"} fillOpacity="0.15" />
                                            <g clipPath="url(#clip0_4880_97)">
                                                <path fillRule="evenodd" clipRule="evenodd" d="M7.32876 9.76813C6.60951 9.76813 6.02644 10.3512 6.02644 11.0705V21.2364C6.02644 21.9557 6.60951 22.5388 7.32876 22.5388H26.4915C27.2108 22.5388 27.7939 21.9557 27.7939 21.2364V11.0705C27.7939 10.3512 27.2108 9.76813 26.4915 9.76813H24.9393C24.6311 9.76813 24.3812 9.51824 24.3812 9.20999C24.3812 8.90174 24.6311 8.65186 24.9393 8.65186H26.4915C27.8273 8.65186 28.9102 9.73471 28.9102 11.0705V21.2364C28.9102 22.5722 27.8273 23.655 26.4915 23.655H7.32876C5.993 23.655 4.91016 22.5722 4.91016 21.2364V11.0705C4.91016 9.73471 5.993 8.65186 7.32876 8.65186H8.881C9.18926 8.65186 9.43914 8.90174 9.43914 9.20999C9.43914 9.51824 9.18926 9.76813 8.881 9.76813H7.32876Z" fill={activeTab === 'municipal' ? "#1E8025" : "#59687D"} />
                                                <path fillRule="evenodd" clipRule="evenodd" d="M18.4918 23.7681H14.4918V26.5123H18.4918V23.7681ZM13.3755 22.6519V27.6286H19.608V22.6519H13.3755Z" fill={activeTab === 'municipal' ? "#1E8025" : "#59687D"} />
                                                <path fillRule="evenodd" clipRule="evenodd" d="M8.59424 27.1636C8.59424 26.8554 8.84412 26.6055 9.15237 26.6055H23.9061C24.2143 26.6055 24.4642 26.8554 24.4642 27.1636C24.4642 27.4719 24.2143 27.7218 23.9061 27.7218H9.15237C8.84412 27.7218 8.59424 27.4719 8.59424 27.1636Z" fill={activeTab === 'municipal' ? "#1E8025" : "#59687D"} />
                                                <path fillRule="evenodd" clipRule="evenodd" d="M20.0435 5.2145C21.2829 6.09137 22.3027 7.55639 22.3667 9.82083C22.406 11.2093 21.8629 12.6336 21.1346 13.9705C20.4059 15.3082 19.453 16.6256 18.5993 17.806L18.5887 17.8206C18.0269 18.5974 17.5117 19.3101 17.1098 19.9515C16.8558 20.3568 16.2658 20.3608 16.0079 19.9553C15.6216 19.348 15.1307 18.6675 14.5935 17.9232L14.5838 17.9097C13.7266 16.722 12.7609 15.3839 12.0109 14.0256C11.2622 12.6696 10.6899 11.2273 10.6899 9.83658C10.6899 8.57889 11.0978 7.17291 12.0464 6.05998C13.0066 4.9334 14.4877 4.14697 16.5441 4.09501M20.0435 5.2145C18.8314 4.35694 17.4274 4.07221 16.5442 4.095L20.0435 5.2145ZM19.3988 6.12577C18.403 5.42131 17.2408 5.19361 16.5727 5.21092L16.5723 5.21092C14.8102 5.25543 13.6362 5.91558 12.896 6.78408C12.1441 7.66625 11.8062 8.80388 11.8062 9.83658C11.8062 10.9433 12.2695 12.1846 12.9881 13.486C13.7026 14.7801 14.6314 16.0682 15.4987 17.2699L15.5057 17.2796C15.8747 17.7909 16.2341 18.2888 16.5554 18.7598C16.8976 18.2541 17.2828 17.7215 17.6765 17.1771L17.6842 17.1664C18.5491 15.9706 19.4627 14.7061 20.1543 13.4365C20.8494 12.1605 21.2818 10.9463 21.2509 9.85238C21.1973 7.95794 20.3674 6.81105 19.3988 6.12577ZM16.5188 8.2368C15.5917 8.2368 14.8305 8.99757 14.8305 9.948C14.8305 10.8984 15.5917 11.6592 16.5188 11.6592C17.4458 11.6592 18.207 10.8984 18.207 9.948C18.207 8.99757 17.4458 8.2368 16.5188 8.2368ZM13.7142 9.948C13.7142 8.39178 14.9645 7.12052 16.5188 7.12052C18.073 7.12052 19.3232 8.39178 19.3232 9.948C19.3232 11.5042 18.073 12.7755 16.5188 12.7755C14.9645 12.7755 13.7142 11.5042 13.7142 9.948Z" fill={activeTab === 'municipal' ? "#1E8025" : "#59687D"} />
                                            </g>
                                            <defs>
                                                <clipPath id="clip0_4880_97">
                                                    <rect width="24" height="24" fill="white" transform="translate(4.91016 4)" />
                                                </clipPath>
                                            </defs>
                                        </svg>
                                        <span className="font-medium">תצוגה יישובית</span>
                                    </Button>

                                    <Button
                                        variant="outline"
                                        onClick={() => handleTab('facilities')}
                                        className={`w-max flex items-center gap-2 justify-between md:px-3 px-2 h-10 border rounded-full transition-all ${activeTab === 'facilities'
                                            ? 'border-[#1E8025] text-[#1E8025] '
                                            : 'border-[#DEDEDE] hover:bg-white/90 text-slate-700 bg-transparent'
                                            }`}
                                    >
                                        <svg width="27" height="26" viewBox="0 0 27 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <g clipPath="url(#clip0_4880_20629)">
                                                <path fillRule="evenodd" clipRule="evenodd" d="M3.52875 15.1202L3.91675 8.39705C3.91008 8.37491 3.90635 8.35117 3.90635 8.3269C3.90635 8.29249 3.91355 8.25969 3.92635 8.23008L3.99328 7.06986C4.00048 6.93997 4.10822 6.83915 4.23675 6.83942L5.63702 6.83888C5.77169 6.83888 5.87809 6.9429 5.88155 7.08586L5.94795 8.23755C5.97302 8.35197 5.96742 8.28369 5.95675 8.38931L6.34476 15.1202H6.62689L10.3714 11.8004C10.5584 11.6347 10.8482 11.7718 10.8482 12.0164V14.8228L14.2571 11.8004C14.444 11.6347 14.7339 11.7716 14.7339 12.0164V14.8225L18.14 11.8004V9.3791H17.7128C17.5779 9.3791 17.4683 9.26974 17.4683 9.13452V7.48914C17.4683 7.35418 17.5776 7.24483 17.7128 7.24483H25.6656C25.8006 7.24483 25.9102 7.35418 25.9102 7.48914V9.13452C25.9102 9.26948 25.8008 9.3791 25.6656 9.3791H25.2384V23.7554C25.2384 23.896 25.1262 24.0056 24.9726 23.9989H18.3968C18.3896 23.9995 18.3824 24 18.3752 24H3.07621C2.94128 24 2.83194 23.8906 2.83194 23.7554V15.409C2.83194 15.2519 2.96101 15.1202 3.11941 15.1202H3.52875ZM4.93702 5.45862C5.21115 5.45862 5.43302 5.6808 5.43302 5.95472C5.43302 6.2289 5.21089 6.45108 4.93702 6.45108C4.66288 6.45108 4.44075 6.2289 4.44075 5.95472C4.44075 5.68106 4.66288 5.45862 4.93702 5.45862ZM4.08262 5.19671C3.96928 5.31246 3.78368 5.3146 3.66795 5.20124C3.55221 5.08789 3.55008 4.90225 3.66341 4.7865C4.36475 4.06903 5.51062 4.07036 6.21062 4.78916C6.32316 4.90492 6.32076 5.09002 6.20476 5.20284C6.08902 5.3154 5.90395 5.313 5.79115 5.19697C5.31435 4.71315 4.55835 4.70995 4.08262 5.19671ZM3.24795 4.43416C4.18102 3.47638 5.69569 3.47878 6.62742 4.43603C6.73996 4.55178 6.92529 4.55445 7.04103 4.44163C7.15676 4.32908 7.15943 4.14371 7.04689 4.02795C5.88955 2.83839 4.01062 2.82906 2.82874 4.02395C2.71541 4.13971 2.71754 4.32534 2.83328 4.4387C2.94874 4.55205 3.13461 4.55018 3.24795 4.43416ZM2.41301 3.65508C2.29968 3.77084 2.11408 3.77297 1.99834 3.65962C1.88261 3.54626 1.88047 3.36063 1.99381 3.24487C3.61835 1.58402 6.26076 1.58429 7.88263 3.2502C7.99516 3.36596 7.99276 3.55133 7.87703 3.66388C7.76129 3.77644 7.57623 3.77404 7.46343 3.65828C6.07329 2.23081 3.82288 2.22094 2.41301 3.65508ZM19.5709 15.0236C19.436 15.0236 19.3264 15.133 19.3264 15.2679L19.3264 17.5596C19.3264 17.6945 19.4357 17.8039 19.5709 17.8039H23.8075C23.9424 17.8039 24.0518 17.6945 24.0518 17.5596L24.0517 15.2679C24.0517 15.133 23.9424 15.0236 23.8075 15.0236H19.5709ZM23.5629 15.5125H19.8152L19.8152 17.3153H23.5629L23.5629 15.5125ZM19.5709 11.0973C19.436 11.0973 19.3264 11.2066 19.3264 11.3416L19.3264 13.4615C19.3264 13.5965 19.4357 13.7058 19.5709 13.7058H23.8075C23.9424 13.7058 24.0517 13.5965 24.0517 13.4615L24.0518 11.3416C24.0518 11.2066 23.9424 11.0973 23.8075 11.0973H19.5709ZM23.5629 11.5862H19.8152L19.8152 13.2172H23.5629L23.5629 11.5862ZM13.593 18.8903C13.4581 18.8903 13.3485 18.9997 13.3485 19.1349L13.3485 20.9333C13.3485 21.0683 13.4578 21.1779 13.593 21.1779H16.3901C16.5251 21.1779 16.6344 21.0685 16.6344 20.9333L16.6344 19.1349C16.6344 19 16.5251 18.8903 16.3901 18.8903H13.593ZM16.1459 19.3792H13.8376L13.8376 20.689H16.1459L16.1459 19.3792ZM9.32716 18.8903C9.19223 18.8903 9.0829 18.9997 9.0829 19.1349L9.0829 20.9333C9.0829 21.0683 9.19223 21.1779 9.32717 21.1779H12.1245C12.2594 21.1779 12.369 21.0685 12.369 20.9333L12.369 19.1349C12.369 19 12.2597 18.8903 12.1245 18.8903H9.32716ZM11.88 19.3792H9.5717L9.5717 20.689H11.88L11.88 19.3792ZM5.06128 18.8903C4.92635 18.8903 4.81675 18.9997 4.81675 19.1349L4.81675 20.9333C4.81675 21.0683 4.92635 21.1779 5.06128 21.1779H7.85863C7.99356 21.1779 8.10289 21.0685 8.10289 20.9333L8.10289 19.1349C8.10289 19 7.99356 18.8903 7.85863 18.8903H5.06128ZM7.61409 19.3792H5.30582L5.30582 20.689H7.61409L7.61409 19.3792ZM20.1035 23.5116V19.7669C20.1035 19.632 20.2128 19.5226 20.3477 19.5226H23.0301C23.1651 19.5226 23.2747 19.632 23.2747 19.7669V23.5116H24.7494V9.37883H18.6288V23.5116H20.1035ZM22.7859 23.5116V20.0115H20.5923V23.5119L22.7859 23.5116ZM25.4214 7.73345H17.9573V8.88994H25.4214V7.73345ZM5.85622 15.1202L5.47835 8.57121H4.39462L4.01728 15.1202H5.85622ZM18.14 12.4511L14.7219 15.484C14.5349 15.6499 14.2451 15.5125 14.2451 15.2679V12.4618L10.8362 15.484C10.6488 15.6502 10.3594 15.512 10.3594 15.2679V12.4618L6.89142 15.5363C6.83782 15.5837 6.77249 15.6091 6.70209 15.6091H3.32075V23.5106H18.14V12.4511ZM4.46662 7.32778L4.42315 8.08232H5.45035L5.40689 7.32778H4.46662Z" fill="#59687D" stroke="#59687D" strokeWidth="0.35" />
                                            </g>
                                            <defs>
                                                <clipPath id="clip0_4880_20629">
                                                    <rect width="26" height="26" fill="white" transform="translate(0.910156)" />
                                                </clipPath>
                                            </defs>
                                        </svg>
                                        <span className="font-medium">מתקני ייצור מחוברים</span>
                                    </Button>

                                    <Button
                                        variant="outline"
                                        onClick={() => handleTab('requests')}
                                        className={`w-max flex items-center gap-2 justify-between md:px-3 px-2 h-10 border rounded-full transition-all ${activeTab === 'requests'
                                            ? 'border-[#1E8025] text-[#1E8025]'
                                            : 'border-[#DEDEDE] hover:bg-white/90 text-slate-700 bg-transparent'
                                            }`}
                                    >
                                        <svg width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M9.36523 7.65845H9.36564" stroke={activeTab === 'requests' ? "#1E8025" : "#59687D"} strokeMiterlimit="2.6131" strokeLinecap="round" strokeLinejoin="round" />
                                            <path d="M13.9629 7.39434V2.32113C13.9629 1.59451 14.5574 1 15.284 1H25.5889C26.3155 1 26.91 1.59451 26.91 2.32113V8.9268C26.91 9.65342 26.3155 10.2479 25.5889 10.2479H21.6255V12.4675L18.9832 10.2479H18.0848" stroke={activeTab === 'requests' ? "#1E8025" : "#59687D"} strokeMiterlimit="2.6131" strokeLinecap="round" strokeLinejoin="round" />
                                            <path d="M16.4731 4.56714H24.3999M24.3999 6.68095H21.3745" stroke={activeTab === 'requests' ? "#1E8025" : "#59687D"} strokeMiterlimit="2.6131" strokeLinecap="round" strokeLinejoin="round" />
                                            <path d="M17.8207 14.317V10.2478V8.97958C17.8207 8.25296 17.2261 7.65845 16.4995 7.65845H13.963H11.7436M6.98758 7.65845H2.23129C1.50467 7.65845 0.910156 8.25296 0.910156 8.97958V19.5486C0.910156 20.2753 1.50467 20.8698 2.23129 20.8698H8.04427V23.512L10.6865 20.8698H14.6261" stroke={activeTab === 'requests' ? "#1E8025" : "#59687D"} strokeMiterlimit="2.6131" strokeLinecap="round" strokeLinejoin="round" />
                                            <path fillRule="evenodd" clipRule="evenodd" d="M16.2113 14.5813H25.5889C26.3155 14.5813 26.91 15.176 26.91 15.9024V23.0365C26.91 23.7631 26.3155 24.3577 25.5889 24.3577H22.0891V26.9999L19.4468 24.3577H16.2113C15.4849 24.3577 14.8901 23.7632 14.8901 23.0365V15.9024C14.8901 15.1758 15.4846 14.5813 16.2113 14.5813Z" stroke={activeTab === 'requests' ? "#1E8025" : "#59687D"} strokeMiterlimit="2.6131" strokeLinecap="round" strokeLinejoin="round" />
                                            <path d="M19.5271 19.9031L18.9185 19.4695L18.4849 20.0782" stroke={activeTab === 'requests' ? "#1E8025" : "#59687D"} strokeMiterlimit="22.9256" strokeLinecap="round" strokeLinejoin="round" />
                                            <path d="M20.1074 17.4102C20.4689 17.2014 20.879 17.0916 21.2964 17.0916C22.5745 17.0916 23.6239 18.1017 23.6727 19.3787" stroke={activeTab === 'requests' ? "#1E8025" : "#59687D"} strokeMiterlimit="2.6131" strokeLinecap="round" strokeLinejoin="round" />
                                            <path d="M23.0659 19.0359L23.6746 19.4696L24.1082 18.8608" stroke={activeTab === 'requests' ? "#1E8025" : "#59687D"} strokeMiterlimit="22.9256" strokeLinecap="round" strokeLinejoin="round" />
                                            <path d="M22.4856 21.5288C22.1241 21.7376 21.714 21.8474 21.2966 21.8474C19.9992 21.8474 18.9412 20.8075 18.9189 19.5103" stroke={activeTab === 'requests' ? "#1E8025" : "#59687D"} strokeMiterlimit="2.6131" strokeLinecap="round" strokeLinejoin="round" />
                                            <path d="M7.91824 12.2835C7.84912 11.9498 7.98087 11.4784 8.4124 11.1494C9.06398 10.6474 10.0191 10.7681 10.521 11.4198C11.023 12.0713 10.9006 13.0151 10.249 13.517L9.90206 13.7843L9.55507 14.0516C9.04602 14.4346 8.97341 14.9327 8.99069 15.6331" stroke={activeTab === 'requests' ? "#1E8025" : "#59687D"} strokeMiterlimit="2.6131" strokeLinecap="round" strokeLinejoin="round" />
                                            <path d="M8.99023 17.689H8.99064" stroke={activeTab === 'requests' ? "#1E8025" : "#59687D"} strokeMiterlimit="2.6131" strokeLinecap="round" strokeLinejoin="round" />
                                        </svg>
                                        <span className="font-medium">בקשות חיבור ותשובות</span>
                                    </Button>
                                </div>
                            </div>
                        </div>
                        {activeTab === 'production' && (
                            <div className="flex justify-between gap-4 relative md:p-[30px] p-6 md:pr-0 w-full">
                                <div className="w-full">
                                    <Image src={image3} width={192} height={308} className='md:w-[192px] w-full md:h-[308px]' alt='image' />
                                </div>
                                <div className="w-full">
                                    <Image src={image2} width={192} height={308} className='md:w-[192px] w-full md:h-[308px] md:mt-40 mt-20' alt='image' />
                                </div>
                                <div className="w-full">
                                    <Image src={image1} width={192} height={308} className='md:w-[192px] w-full md:h-[308px]' alt='image' />
                                </div>
                            </div>
                        )}
                    </div>
                </section>

                {activeTab === 'production' && (
                    <div className="flex flex-col gap-4 bg-[#FDFBF6] border border-[#DEDEDE]/70 md:rounded-[40px] rounded-[20px] md:px-[60px] px-5 md:py-[50px] py-5">
                        <h1 className='text-[#276E4E] md:text-[34px] text-2xl font-extrabold'>ייצור אנרגיות מתחדשות</h1>
                        <div className="flex flex-col gap-10">
                            <RenewableProduction />
                            <RenewableProduction2 />
                        </div>
                    </div>
                )}

                {activeTab === 'municipal' && (
                    <div className="">
                        <CommunityDisplay />
                    </div>
                )}

                {activeTab === 'facilities' && (
                    <div className="">
                        <ProductionFacility />
                    </div>
                )}

                {activeTab === 'requests' && (
                    <div className="">
                        <ConnectionRequests />
                    </div>
                )}

                {/* Bottom Section - Additional Data Links */}
            </div>

            <InterestPage />
        </div >
    )
}

export default page